src/СРМ/src/Documents/ОтчетПоРаботамПартнеру/ОтчетПоРаботамПартнеру.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтчетПоРаботамПартнеру</name>
  <registerRecords>AccumulationRegister.ВысталенныеЗадачи</registerRecords>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОтчетовПоРаботамПартнеру</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Задачи</name>
    <attributes>
      <name>Задача</name>
      <type>
        <types>CatalogRef.RA_RedmineЗадачи</types>
        <types>DocumentRef.Задача</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидОплаты</name>
      <type>
        <types>CatalogRef.ВидыОплатыЗадач</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтактОбращения</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/СРМ/src/AccumulationRegisters/ВысталенныеЗадачи/ВысталенныеЗадачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВысталенныеЗадачи</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>CatalogRef.RA_RedmineЗадачи</types>
      <types>DocumentRef.Задача</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОплаты</name>
    <type>
      <types>CatalogRef.ВидыОплатыЗадач</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/СРМ/src/Enums/СтатусыОтчетовПоРаботамПартнеру/СтатусыОтчетовПоРаботамПартнеру.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыОтчетовПоРаботамПартнеру</name>
  <enumValues>
    <name>Формируется</name>
  </enumValues>
  <enumValues>
    <name>Утвержден</name>
  </enumValues>
  <enumValues>
    <name>Выставлен</name>
  </enumValues>
</mdclass:Enum>

src/СРМ/src/Documents/ОтчетПоРаботамПартнеру/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	Если Статус=Перечисления.СтатусыОтчетовПоРаботамПартнеру.Формируется Тогда
		Возврат;
	КонецЕсли;
	
	// регистр ВысталенныеЗадачи 
	Движения.ВысталенныеЗадачи.Записывать = Истина;
	Для Каждого ТекСтрокаЗадачи Из Задачи Цикл
		Движение = Движения.ВысталенныеЗадачи.Добавить();
		Движение.Период = Дата;
		Движение.ПериодРегистрации = ПериодРегистрации;
		Движение.Партнер = Партнер;
		Движение.Задача = ТекСтрокаЗадачи.Задача;
		Движение.Исполнитель = ТекСтрокаЗадачи.Исполнитель;
		Движение.КоличествоЧасов = ТекСтрокаЗадачи.КоличествоЧасов;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Ответственный=ПользователиКлиентСервер.ТекущийПользователь();
	ПериодРегистрации=НачалоМесяца(ТекущаяДата());
	Статус=Перечисления.СтатусыОтчетовПоРаботамПартнеру.Формируется;
КонецПроцедуры
